espressif/esp-idf/components/soc/esp32p4/register/hw_ver1/soc/lp_clkrst_reg.h
/** LP_CLKRST_HP_SDMMC_EMAC_RST_CTRL_REG register
 *  need_des
 */
#define LP_CLKRST_HP_SDMMC_EMAC_RST_CTRL_REG (DR_REG_LP_CLKRST_BASE + 0x4c)
/** LP_CLKRST_RST_EN_SDMMC : R/W; bitpos: [28]; default: 0;
 *  hp sdmmc reset en
 */
#define LP_CLKRST_RST_EN_SDMMC    (BIT(28))
#define LP_CLKRST_RST_EN_SDMMC_M  (LP_CLKRST_RST_EN_SDMMC_V << LP_CLKRST_RST_EN_SDMMC_S)
#define LP_CLKRST_RST_EN_SDMMC_V  0x00000001U
#define LP_CLKRST_RST_EN_SDMMC_S  28
/** LP_CLKRST_FORCE_NORST_SDMMC : R/W; bitpos: [29]; default: 0;
 *  hp sdmmc force norst
 */
#define LP_CLKRST_FORCE_NORST_SDMMC    (BIT(29))
#define LP_CLKRST_FORCE_NORST_SDMMC_M  (LP_CLKRST_FORCE_NORST_SDMMC_V << LP_CLKRST_FORCE_NORST_SDMMC_S)
#define LP_CLKRST_FORCE_NORST_SDMMC_V  0x00000001U
#define LP_CLKRST_FORCE_NORST_SDMMC_S  29
/** LP_CLKRST_RST_EN_EMAC : R/W; bitpos: [30]; default: 0;
 *  hp emac reset en
 */
#define LP_CLKRST_RST_EN_EMAC    (BIT(30))
#define LP_CLKRST_RST_EN_EMAC_M  (LP_CLKRST_RST_EN_EMAC_V << LP_CLKRST_RST_EN_EMAC_S)
#define LP_CLKRST_RST_EN_EMAC_V  0x00000001U
#define LP_CLKRST_RST_EN_EMAC_S  30
/** LP_CLKRST_FORCE_NORST_EMAC : R/W; bitpos: [31]; default: 0;
 *  hp emac force norst
 */
#define LP_CLKRST_FORCE_NORST_EMAC    (BIT(31))
#define LP_CLKRST_FORCE_NORST_EMAC_M  (LP_CLKRST_FORCE_NORST_EMAC_V << LP_CLKRST_FORCE_NORST_EMAC_S)
#define LP_CLKRST_FORCE_NORST_EMAC_V  0x00000001U
#define LP_CLKRST_FORCE_NORST_EMAC_S  31

/** LP_CLKRST_DATE_REG register
 *  need_des
 */
#define LP_CLKRST_DATE_REG (DR_REG_LP_CLKRST_BASE + 0x3fc)
/** LP_CLKRST_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need_des
 */
#define LP_CLKRST_CLK_EN    (BIT(31))
#define LP_CLKRST_CLK_EN_M  (LP_CLKRST_CLK_EN_V << LP_CLKRST_CLK_EN_S)
#define LP_CLKRST_CLK_EN_V  0x00000001U
#define LP_CLKRST_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
